app/helpers/pets_helper.rb

  def get_custom_field_values(organization, table_type, field_name)
    custom_object = organization.custom_objects.find_by(api_name: table_type)
    return [] unless custom_object

    # Try both patterns: pet_breed_field and pets_breed_field
    custom_field = custom_object.custom_fields.find_by(api_name: "pet_#{field_name}_field") ||
                   custom_object.custom_fields.find_by(api_name: "#{table_type}_#{field_name}_field")
---
SELECT "custom_objects".* FROM "custom_objects" WHERE "custom_objects"."organization_id" = $1 AND "custom_objects"."api_name" = $2 LIMIT $3  [["organization_id", 1], ["api_name", "pets"], ["LIMIT", 1]]
SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."custom_object_id" = $1 AND "custom_fields"."api_name" = $2 LIMIT $3  [["custom_object_id", 1], ["api_name", "pets_name_field"], ["LIMIT", 1]]