app/helpers/record_layouts_helper.rb

SELECT "custom_objects".* FROM "custom_objects" WHERE "custom_objects"."organization_id" = $1 AND "custom_objects"."api_name" = $2 LIMIT $3  [["organization_id", 1], ["api_name", "pets"], ["LIMIT", 1]]
SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."custom_object_id" = $1 AND "custom_fields"."api_name" = $2 LIMIT $3  [["custom_object_id", 1], ["api_name", "pets_name_field"], ["LIMIT", 1]]
---
  def record_layout_metadata_json(organization, table_type, table_id, layout = nil)
    fields = []
    components = []

    # Use provided layout or try to find existing layout
    unless layout
      begin
        layout = organization.record_layouts.find_by(table_type: table_type, table_id: table_id)
      rescue => e
        Rails.logger.warn "Could not find layout for #{table_type} #{table_id}: #{e.message}"
      end
    end

    case table_type
    when 'Pet'
      base_excludes = %w[id created_at updated_at organization_id]
      pet_attrs = Pet.attribute_names.reject { |n| base_excludes.include?(n) }
      pets_co = organization.custom_objects.find_by(api_name: 'pets')
      fields = pet_attrs.map do |name|
        # Prefer CustomField type when present
        cf = nil
        if pets_co
          cf = pets_co.custom_fields.find_by(api_name: "pet_#{name}_field") ||
               pets_co.custom_fields.find_by(api_name: "pets_#{name}_field") ||
               pets_co.custom_fields.find_by(api_name: name)

SELECT "custom_objects".* FROM "custom_objects" WHERE "custom_objects"."organization_id" = $1 AND "custom_objects"."api_name" = $2 LIMIT $3  [["organization_id", 1], ["api_name", "pets"], ["LIMIT", 1]]
SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."custom_object_id" = $1 AND "custom_fields"."field_type" IN ($2, $3)  [["custom_object_id", 1], ["field_type", 6], ["field_type", 7]]
---
  def record_layout_options_map(organization, table_type)
    options = {}
    if table_type == 'Pet'
      ensure_builtin_pets_custom_fields!(organization)
      begin
        pets_co = organization.custom_objects.find_by(api_name: 'pets')
        if pets_co
          pets_co.custom_fields.where(field_type: [:picklist, :multipicklist]).each do |cf|

SELECT "custom_objects".* FROM "custom_objects" WHERE "custom_objects"."organization_id" = $1 AND "custom_objects"."api_name" = $2 LIMIT $3  [["organization_id", 1], ["api_name", "pets"], ["LIMIT", 1]]
SELECT "custom_fields".* FROM "custom_fields" WHERE "custom_fields"."custom_object_id" = $1 AND "custom_fields"."api_name" = $2 LIMIT $3  [["custom_object_id", 1], ["api_name", "pets_species_field"], ["LIMIT", 1]]
---
  def ensure_builtin_pets_custom_fields!(organization)
    pets_co = organization.custom_objects.find_or_create_by!(api_name: 'pets') do |co|
      co.name = 'Pets'
      co.description = 'Built-in Pet fields'
      co.active = true
    end
    required_fields = {
      'species' => :picklist,
      'breed' => :multipicklist,
      'color' => :multipicklist,
      'flags' => :multipicklist,
      'sex' => :picklist,
      'coat_type' => :picklist,
      'location' => :picklist,
      'unit' => :picklist
    }
    required_fields.each do |api_name, ftype|
      cf = pets_co.custom_fields.find_by(api_name: "pet_#{api_name}_field") ||
           pets_co.custom_fields.find_by(api_name: "pets_#{api_name}_field") ||
           pets_co.custom_fields.find_by(api_name: api_name)