app/views/posts/_post.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% if current_user == post.user %>
      <% if post.pet.present? && post.pet.organization.present? %>

SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = $1 AND "reactions"."user_id" = $2 LIMIT $3  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = $1 AND "reactions"."reaction_type" = $2  [["post_id", 1], ["reaction_type", "Love"]]
---
  <% always_solid = ["Congratulations", "Laugh", "Angry"] %>
  <% user_reaction = post.reactions.find_by(user_id: current_user.id) %>
  <% reaction_types.each do |rtype, (icon_class, color)| %>
    <% count_for_this_type = post.reactions.where(reaction_type: rtype).count %>