app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    user = super
    return user unless user

    # If the user is being impersonated, return the impersonated user
    if user.impersonated_by_id.present?
      # Use find_by to avoid recursion and get a fresh instance
      User.find_by(id: user.id)

SELECT "pinned_tabs".* FROM "pinned_tabs" WHERE "pinned_tabs"."user_id" = $1 ORDER BY COALESCE(position, 999999), created_at ASC  [["user_id", 1]]
---
  def setup_navbar_data
    return unless current_user
    @pinned_tabs = current_user.pinned_tabs.ordered
    Rails.logger.info "Setting up navbar data - Pinned tabs: #{@pinned_tabs.map { |t| { id: t.id, title: t.title, position: t.position, tab_type: t.tab_type } }}"