app/controllers/custom_objects_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_organization
    @organization = Organization.find(params[:organization_id])

SELECT "custom_objects".* FROM "custom_objects" WHERE "custom_objects"."organization_id" = $1 AND "custom_objects"."id" = $2 LIMIT $3  [["organization_id", 1], ["id", 4], ["LIMIT", 1]]
---
  def set_custom_object
    @custom_object = @organization.custom_objects.find(params[:id])