app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."organization_id" = $1 AND "events"."start_time" BETWEEN $2 AND $3 AND "events"."calendar_id" IN ($4, $5) ORDER BY "events"."start_time" ASC  [["organization_id", 1], ["start_time", "2025-10-26 07:00:00"], ["start_time", "2025-12-06 07:59:59.999999"], ["calendar_id", 1], ["calendar_id", 2]]
---
  def index
    @view = params[:view] || 'month'
    @start_date = params[:start_date]&.to_date || Date.current

    # Auto-create Personal calendar if none exist
    ensure_personal_calendar_exists

    case @view
    when 'day'
      @end_date = @start_date
      @events = @organization.events.includes(:organizer, :participants, :calendar)
                             .where(start_time: @start_date.beginning_of_day..@start_date.end_of_day)
                             .order(:start_time)

SELECT "calendars"."id" FROM "calendars" LEFT OUTER JOIN "events" ON "events"."calendar_id" = "calendars"."id" WHERE "calendars"."organization_id" = $1  [["organization_id", 1]]
---
      Rails.logger.debug "Events loaded: #{@events.count}"
    end

    @calendars = @organization.calendars.includes(:events)
    @selected_calendar_ids = params[:calendar_ids]&.map(&:to_i) || @calendars.pluck(:id)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_organization
    @organization = Organization.find(params[:organization_id])

SELECT 1 AS one FROM "calendars" WHERE "calendars"."organization_id" = $1 AND "calendars"."name" = $2 LIMIT $3  [["organization_id", 1], ["name", "HCSO"], ["LIMIT", 1]]
SELECT 1 AS one FROM "calendars" WHERE "calendars"."organization_id" = $1 AND "calendars"."name" = $2 AND "calendars"."created_by_id" = $3 LIMIT $4  [["organization_id", 1], ["name", "Personal"], ["created_by_id", 1], ["LIMIT", 1]]
SELECT "calendars".* FROM "calendars" WHERE "calendars"."organization_id" = $1 AND "calendars"."name" = $2 LIMIT $3  [["organization_id", 1], ["name", "HCSO"], ["LIMIT", 1]]
---
  def ensure_personal_calendar_exists
    # Create organization calendar if it doesn't exist
    unless @organization.calendars.exists?(name: @organization.name)
      @organization.calendars.create!(
        name: @organization.name,
        description: "Organization-wide calendar for #{@organization.name}",
        color: '#28a745',
        is_public: true,
        created_by: current_user
      )
    end

    # Create personal calendar if it doesn't exist
    unless @organization.calendars.exists?(name: 'Personal', created_by: current_user)
      personal_calendar = @organization.calendars.create!(
        name: 'Personal',
        description: 'Your personal calendar for private events',
        color: '#3788d8',
        is_public: false,
        created_by: current_user
      )
    end

    # Set organization calendar as default if no calendars are selected
    if @selected_calendar_ids.blank?
      org_calendar = @organization.calendars.find_by(name: @organization.name)