app/controllers/feed_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @posts = Post.includes(:user, :pet, post_attachments: { file_attachment: :blob })
                 .order(created_at: :desc)
                 .page(params[:page])
                 .per(10)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_organization
    if current_user.shelter_staff?
      @organization = current_user.organizations.first
    elsif current_user.admin?
      # For admin users, try to get the organization from the session
      @organization = Organization.find_by(id: session[:organization_id]) if session[:organization_id]