app/controllers/organization_tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @query = params[:query]

    # Get or create default list view
    @current_view = if params[:view_id].present?
      @organization.list_views.find_by(id: params[:view_id])
    else
      @organization.list_views.for_object_type('Task').default_view.first ||
      @organization.list_views.for_object_type('Task').public_or_user(current_user).first

SELECT 1 AS one FROM "tasks" WHERE "tasks"."organization_id" = $1 LIMIT $2 OFFSET $3  [["organization_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
---
    @columns = if @current_view&.columns&.any?
      # Use columns from the view
      available_columns = ListView.available_columns_for('Task', @organization)
      available_columns.select { |col| @current_view.columns.include?(col[:api_name]) }

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @task = Task.new(task_params)
    @task.organization = @organization

    if params[:task][:pet_id].present?
      @task.pet = @organization.pets.find(params[:task][:pet_id])

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_organization
    @organization = Organization.find(params[:organization_id])