app/controllers/pets_controller.rb

  def index
    @query = params[:query]
    @pets = if @query.present?
              @organization.pets.where("name ILIKE :query OR breed ILIKE :query OR description ILIKE :query", query: "%#{@query}%")
            else
              @organization.pets
            end
    @pets = @pets.order(:name).page(params[:page]).per(10)

    # Get pinned status for all pets
    @pinned_pet_ids = current_user.pinned_tabs.where(tabable_type: 'Pet', tab_type: 'pet').pluck(:tabable_id)
---
SELECT "pinned_tabs"."tabable_id" FROM "pinned_tabs" WHERE "pinned_tabs"."user_id" = $1 AND "pinned_tabs"."tabable_type" = $2 AND "pinned_tabs"."tab_type" = $3  [["user_id", 1], ["tabable_type", "Pet"], ["tab_type", "pet"]]

  def show
    @posts = @pet.posts.includes(images_attachments: :blob)
    @is_pinned = current_user.pinned_tabs.exists?(tabable: @pet, tab_type: 'pet')
    @record_layout = RecordLayout.find_by(organization: @organization, table_type: 'Pet')
---
SELECT "pinned_tabs".* FROM "pinned_tabs" WHERE "pinned_tabs"."user_id" = $1 ORDER BY COALESCE(position, 999999), created_at ASC  [["user_id", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."organization_id" = $1 AND "pets"."id" = $2 LIMIT $3  [["organization_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT "record_layouts".* FROM "record_layouts" WHERE "record_layouts"."organization_id" = $1 AND "record_layouts"."table_type" = $2 LIMIT $3  [["organization_id", 1], ["table_type", "Pet"], ["LIMIT", 1]]

  def set_organization
    @organization = Organization.find_by(id: params[:organization_id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_pet
    @pet = @organization.pets.find_by(id: params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."organization_id" = $1 AND "pets"."id" = $2 LIMIT $3  [["organization_id", 1], ["id", 4], ["LIMIT", 1]]