app/controllers/pets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."organization_id" = $1 ORDER BY "pets"."name" ASC LIMIT $2 OFFSET $3  [["organization_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @query = params[:query]

    # Get or create default list view
    @current_view = if params[:view_id].present?
      @organization.list_views.find_by(id: params[:view_id])
    else
      @organization.list_views.for_object_type('Pet').default_view.first ||
      @organization.list_views.for_object_type('Pet').public_or_user(current_user).first
    end

    # Start with base query
    @pets = @organization.pets

    # Apply list view filters if present
    if @current_view.present?
      @pets = @current_view.apply_filters(@pets)
      @pets = @current_view.apply_sorting(@pets)
    else
      @pets = @pets.order(:name)
    end

    # Apply search query if present
    if @query.present?
      @pets = @pets.where("name ILIKE :query OR breed::text ILIKE :query OR description ILIKE :query", query: "%#{@query}%")
    end

    @pets = @pets.page(params[:page]).per(10)

SELECT 1 AS one FROM "pets" WHERE "pets"."organization_id" = $1 LIMIT $2 OFFSET $3  [["organization_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
---
    @columns = if @current_view&.columns&.any?
      # Use columns from the view
      available_columns = ListView.available_columns_for('Pet', @organization)
      available_columns.select { |col| @current_view.columns.include?(col[:api_name]) }