app/models/user.rb

  def self.find_for_authentication(conditions)
    Rails.logger.debug "=== Finding User for Authentication ==="
    Rails.logger.debug "Conditions: #{conditions.inspect}"
    Rails.logger.debug "Email from conditions: #{conditions[:email]}"
    Rails.logger.debug "Email downcased: #{conditions[:email]&.downcase}"
    Rails.logger.debug "Current database: #{connection.current_database}"
    Rails.logger.debug "Connection config: #{connection_db_config.inspect}"

    # Use case-insensitive email matching
    if conditions[:email].present?
      # First try a direct SQL query
      direct_result = connection.execute("SELECT * FROM users WHERE LOWER(email) = LOWER('#{conditions[:email]}')").to_a
      Rails.logger.debug "Direct SQL result: #{direct_result.inspect}"

      # Then try ActiveRecord
      user = where("LOWER(email) = ?", conditions[:email].downcase).first
---
SELECT "users".* FROM "users" WHERE (LOWER(email) = 'scottandvega@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]