app/controllers/users/sessions_controller.rb

  def create
    Rails.logger.debug "=== Authentication Attempt ==="
    Rails.logger.debug "Email: #{params[:user][:email]}"
    Rails.logger.debug "Password length: #{params[:user][:password].length}"
---
SELECT "users".* FROM "users" WHERE (LOWER(email) = 'scottandvega@gmail.com') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]